Revit 2026 API

# SymbolGeometryId Class

---

This class is used to identify a piece of geometry managed by a symbol element.

SystemObject Autodesk.Revit.DBSymbolGeometryId

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SymbolGeometryId : IDisposable
```
```vb
Public Class SymbolGeometryId
	Implements IDisposable
```
```cpp
public ref class SymbolGeometryId : IDisposable
```
```fsharp
type SymbolGeometryId =
    class
        interface IDisposable
    end
```

The SymbolGeometryId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SymbolId | The id of the symbol which contains the shared geometry. |

|  | Name | Description |
| --- | --- | --- |
|  | AsUniqueIdentifier | Returns a string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element. |
|  | Dispose | Releases all resources used by the SymbolGeometryId |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This class can be used to compare if two instances points to the same piece of geometry managed by a symbol element. The string returned by AsIdentifier can be used to achieve this.

#### Reference

Autodesk.Revit.DB Namespace